tiborsimon/embedded-tdd-headers/pic/pic18/pic18f83j90_tdd.h
#define PGD                           522
#define KBI3                          523
#define PORTB_RB7                     524
#define PORTC                         525
#define T13CKI                        526
#define T1OSO                         527
#define PORTC_RC0                     528
#define SEG32                         529
#define PORTC_CCP2                    530
#define T1OSI                         531
#define PORTC_RC1                     532
#define PA2                           533
#define SEG13                         534
#define CCP1                          535
#define PA1                           536
#define PORTC_RC2                     537
#define SEG17                         538
#define SCL                           539
#define SCK                           540
#define PORTC_RC3                     541
#define SEG16                         542
#define SDA                           543
#define SDI                           544
#define PORTC_RC4                     545
#define SEG12                         546
#define SDO                           547
#define PORTC_RC5                     548
#define SEG27                         549
#define PORTC_RC6                     550
#define TX1                           551
#define CK1                           552
#define RX1                           553
#define SEG28                         554
#define DT1                           555
#define PORTC_RC7                     556
#define PORTD                         557
#define SEG0                          558
#define PORTD_RD0                     559
#define PORTD_RD1                     560
#define SEG1                          561
#define PORTD_RD2                     562
#define SEG2                          563
#define PORTD_RD3                     564
#define SEG3                          565
#define SEG4                          566
#define PORTD_RD4                     567
#define SEG5                          568
#define PORTD_RD5                     569
#define SEG6                          570
#define PORTD_RD6                     571
#define PORTD_RD7                     572
#define SEG7                          573
#define SS2                           574
#define PORTE                         575
#define PD2                           576
#define RDE                           577
#define PORTE_RE0                     578
#define LCDBIAS1                      579
#define WRE                           580
#define PORTE_RE1                     581
#define LCDBIAS2                      582
#define PC2                           583
#define COM0                          584
#define CCP9E                         585
#define PORTE_RE3                     586
#define PC3E                          587
#define PB3E                          588
#define COM1                          589
#define PORTE_RE4                     590
#define CCP8E                         591
#define COM2                          592
#define CCP7E                         593
#define PORTE_RE5                     594
#define PC1E                          595
#define CCP6E                         596
#define COM3                          597
#define PORTE_RE6                     598
#define PB1E                          599
#define PORTE_CCP2                    600
#define CCP2E                         601
#define SEG31                         602
#define PA2E                          603
#define PORTE_RE7                     604
#define PORTF                         605
#define PORTF_RF1                     606
#define SEG19                         607
#define C2OUTF                        608
#define AN6                           609
#define PORTF_C2OUT                   610
#define AN7                           611
#define C1OUTF                        612
#define PORTF_C1OUT                   613
#define SEG20                         614
#define PORTF_RF2                     615
#define PORTF_RF3                     616
#define AN8                           617
#define SEG21                         618
#define C2INB                         619
#define PORTF_RF4                     620
#define AN9                           621
#define SEG22                         622
#define C2INA                         623
#define C1INB                         624
#define PORTF_RF5                     625
#define SEG23                         626
#define CVREF                         627
#define AN10                          628
#define C1INA                         629
#define PORTF_RF6                     630
#define SEG24                         631
#define AN11                          632
#define PORTF_RF7                     633
#define SS1                           634
#define AN5                           635
#define SEG25                         636
#define PORTG                         637
#define LCDBIAS0                      638
#define PORTG_RG0                     639
#define C3OUTG                        640
#define TX2                           641
#define PORTG_RG1                     642
#define CK2                           643
#define VLCAP1                        644
#define RX2                           645
#define PORTG_RG2                     646
#define DT2                           647
#define VLCAP2                        648
#define PORTG_RG3                     649
#define SEG26                         650
#define PORTG_RG4                     651
#define PORTG_RJPU                    652
#define RG5                           653
#define REPU                          654
#define RG6                           655
#define RDPU                          656
#define RG7                           657
#define PORTH                         658
#define PORTH_RH0                     659
#define SEG47                         660
#define PORTH_RH1                     661
#define SEG46                         662
#define PORTH_RH2                     663
#define SEG45                         664
#define PORTH_RH3                     665
#define SEG44                         666
#define PORTH_RH4                     667
#define CCP9                          668
#define SEG40                         669
#define PC3                           670
#define PORTH_RH5                     671
#define CCP8                          672
#define PB3                           673
#define SEG41                         674
#define PORTH_RH6                     675
#define CCP7                          676
#define SEG42                         677
#define PC1                           678
#define PORTH_RH7                     679
#define CCP6                          680
#define PB1                           681
#define SEG43                         682
#define PORTJ                         683
#define PORTJ_RJ0                     684
#define SEG33                         685
#define PORTJ_RJ1                     686
#define SEG34                         687
#define PORTJ_RJ2                     688
#define SEG35                         689
#define PORTJ_RJ3                     690
#define SEG39                         691
#define PORTJ_RJ4                     692
#define SEG38                         693
#define PORTJ_RJ5                     694
#define SEG37                         695
#define PORTJ_RJ6                     696
#define SEG36                         697
#define PORTJ_RJ7                     698
#define LATA                          699
#define LATA0                         700
#define LA0                           701
#define LATA1                         702
#define LA1                           703
#define LATA2                         704
#define LA2                           705
#define LATA3                         706
#define LA3                           707
#define LATA4                         708
#define LA4                           709
#define LATA5                         710
#define LA5                           711
#define LATA6                         712
#define LA6                           713
#define LATA7                         714
#define LA7                           715
#define LATB                          716
#define LB0                           717
#define LATB0                         718
#define LB1                           719
#define LATB1                         720
#define LB2                           721
#define LATB2                         722
#define LB3                           723
#define LATB3                         724
#define LB4                           725
#define LATB4                         726
#define LB5                           727
#define LATB5                         728
#define LB6                           729
#define LATB6                         730
#define LB7                           731
#define LATB7                         732
#define LATC                          733
#define LATC0                         734
#define LC0                           735
#define LATC1                         736
#define LC1                           737
#define LATC2                         738
#define LC2                           739
#define LATC3                         740
#define LC3                           741
#define LATC4                         742
#define LC4                           743
#define LATC5                         744
#define LC5                           745
#define LATC6                         746
#define LC6                           747
#define LATC7                         748
#define LC7                           749
#define LATD                          750
#define LATD0                         751
#define LD0                           752
#define LATD1                         753
#define LD1                           754
#define LATD2                         755
#define LD2                           756
#define LATD3                         757
#define LD3                           758
#define LATD4                         759
#define LD4                           760
#define LATD5                         761
#define LD5                           762
#define LATD6                         763
#define LD6                           764
#define LATD7                         765
#define LD7                           766
#define LATE                          767
#define LATE0                         768
#define LE0                           769
#define LATE1                         770
#define LE1                           771
#define LATE3                         772
#define LE3                           773
#define LATE4                         774
#define LE4                           775
#define LATE5                         776
#define LE5                           777
#define LATE6                         778
#define LE6                           779
#define LATE7                         780
#define LE7                           781
#define LATF                          782
#define LATF1                         783
#define LF1                           784
#define LF2                           785
#define LATF2                         786
#define LF3                           787
#define LATF3                         788
#define LF4                           789
#define LATF4                         790
#define LF5                           791
#define LATF5                         792
#define LF6                           793
#define LATF6                         794
#define LF7                           795
#define LATF7                         796
#define LATG                          797
#define LATG0                         798
#define LG0                           799
#define LATG1                         800
#define LG1                           801
#define LG2                           802
#define LATG2                         803
#define LATG3                         804
#define LG3                           805
#define LATG4                         806
#define LG4                           807
#define U1OD                          808
#define U2OD                          809
#define LATH                          810
#define LH0                           811
#define LATH0                         812
#define LH1                           813
#define LATH1                         814
#define LH2                           815
#define LATH2                         816
#define LH3                           817
#define LATH3                         818
#define LH4                           819
#define LATH4                         820
#define LH5                           821
#define LATH5                         822
#define LH6                           823
#define LATH6                         824
#define LH7                           825
#define LATH7                         826
#define LATJ                          827
#define LATJ0                         828
#define LJ0                           829
#define LATJ1                         830
#define LJ1                           831
#define LATJ2                         832
#define LJ2                           833
#define LATJ3                         834
#define LJ3                           835
#define LATJ4                         836
#define LJ4                           837
#define LATJ5                         838
#define LJ5                           839
#define LATJ6                         840
#define LJ6                           841
#define LATJ7                         842
#define LJ7                           843
#define TRISA                         844
#define TRISA0                        845
#define TRISA_RA0                     846
#define TRISA1                        847
#define TRISA_RA1                     848
#define TRISA2                        849
#define TRISA_RA2                     850
#define TRISA3                        851
#define TRISA_RA3                     852
#define TRISA_RA4                     853
#define TRISA4                        854
#define TRISA_RA5                     855
#define TRISA5                        856
#define TRISA_RA6                     857
#define TRISA6                        858
#define TRISA_RA7                     859
#define TRISA7                        860
#define TRISB                         861
#define TRISB_RB0                     862
#define TRISB0                        863
#define TRISB_RB1                     864
#define TRISB1                        865
#define TRISB_RB2                     866
#define TRISB2                        867
#define TRISB_RB3                     868
#define TRISB3                        869
#define TRISB_RB4                     870
#define TRISB4                        871
#define TRISB_RB5                     872
#define TRISB5                        873
#define TRISB_RB6                     874
#define TRISB6                        875
#define TRISB_RB7                     876
#define TRISB7                        877
#define TRISC                         878
#define TRISC0                        879
#define TRISC_RC0                     880
#define TRISC1                        881
#define TRISC_RC1                     882
#define TRISC2                        883
#define TRISC_RC2                     884
#define TRISC3                        885
#define TRISC_RC3                     886
#define TRISC4                        887
#define TRISC_RC4                     888
#define TRISC5                        889
#define TRISC_RC5                     890
#define TRISC6                        891
#define TRISC_RC6                     892
#define TRISC7                        893
#define TRISC_RC7                     894
#define TRISD                         895
#define TRISD_RD0                     896
#define TRISD0                        897
#define TRISD_RD1                     898
#define TRISD1                        899
#define TRISD_RD2                     900
#define TRISD2                        901
#define TRISD_RD3                     902
#define TRISD3                        903
#define TRISD_RD4                     904
#define TRISD4                        905
#define TRISD_RD5                     906
#define TRISD5                        907
#define TRISD_RD6                     908
#define TRISD6                        909
#define TRISD_RD7                     910
#define TRISD7                        911
#define TRISE                         912
#define TRISE_RE0                     913
#define TRISE0                        914
#define TRISE1                        915
#define TRISE_RE1                     916
#define TRISE_RE3                     917
#define TRISE3                        918
#define TRISE_RE4                     919
#define TRISE4                        920
#define TRISE_RE5                     921
#define TRISE5                        922
#define TRISE_RE6                     923
#define TRISE6                        924
#define TRISE_RE7                     925
#define TRISE7                        926
#define TRISF                         927
#define TRISF_RF1                     928
#define TRISF1                        929
#define TRISF2                        930
#define TRISF_RF2                     931
#define TRISF_RF3                     932
#define TRISF3                        933
#define TRISF_RF4                     934
#define TRISF4                        935
#define TRISF_RF5                     936
#define TRISF5                        937
#define TRISF_RF6                     938
#define TRISF6                        939
#define TRISF7                        940
#define TRISF_RF7                     941
#define TRISG                         942
#define TRISG0                        943
#define TRISG_RG0                     944
#define TRISG1                        945
#define TRISG_RG1                     946
#define TRISG2                        947
#define TRISG_RG2                     948
#define TRISG_RG3                     949
#define TRISG3                        950
#define TRISG4                        951
#define TRISG_RG4                     952
#define CCP1OD                        953
#define CCP2OD                        954
#define SPIOD                         955
#define TRISH                         956
#define TRISH_RH0                     957
#define TRISH0                        958
#define TRISH_RH1                     959
#define TRISH1                        960
#define TRISH_RH2                     961
#define TRISH2                        962
#define TRISH_RH3                     963
#define TRISH3                        964
#define TRISH_RH4                     965
#define TRISH4                        966
#define TRISH_RH5                     967
#define TRISH5                        968
#define TRISH_RH6                     969
#define TRISH6                        970
#define TRISH_RH7                     971
#define TRISH7                        972
#define TRISJ                         973
#define TRISJ_RJ0                     974
#define TRISJ0                        975
#define TRISJ_RJ1                     976
#define TRISJ1                        977
#define TRISJ_RJ2                     978
#define TRISJ2                        979
#define TRISJ_RJ3                     980
#define TRISJ3                        981
#define TRISJ_RJ4                     982
#define TRISJ4                        983
#define TRISJ_RJ5                     984
#define TRISJ5                        985
#define TRISJ_RJ6                     986
#define TRISJ6                        987
#define TRISJ_RJ7                     988
#define TRISJ7                        989
#define OSCTUNE                       990
#define TUN0                          991
#define TUN1                          992
#define TUN2                          993
#define TUN3                          994
#define TUN4                          995
#define TUN5                          996
#define PLLEN                         997
#define INTSRC                        998
#define PIE1                          999
#define TMR1IE                        1000
#define TMR2IE                        1001
#define SSPIE                         1002
#define SSP1IE                        1003
#define TXIE                          1004
#define TX1IE                         1005
#define RCIE                          1006
#define RC1IE                         1007
#define ADIE                          1008
#define PIR1                          1009
#define TMR1IF                        1010
#define TMR2IF                        1011
#define SSP1IF                        1012
#define SSPIF                         1013
#define TXIF                          1014
#define TX1IF                         1015
#define RCIF                          1016
#define RC1IF                         1017
#define ADIF                          1018
#define IPR1                          1019
#define TMR1IP                        1020
#define TMR2IP                        1021
#define SSPIP                         1022
#define SSP1IP                        1023
#define TX1IP                         1024
#define TXIP                          1025
#define RCIP                          1026
#define RC1IP                         1027
#define ADIP                          1028
#define PIE2                          1029
#define TMR3IE                        1030
#define LVDIE                         1031
#define BCLIE                         1032
#define BCL1IE                        1033
#define CMIE                          1034
#define OSCFIE                        1035
#define PIR2                          1036
#define TMR3IF                        1037
#define LVDIF                         1038
#define BCL1IF                        1039
#define BCLIF                         1040
#define CMIF                          1041
#define OSCFIF                        1042
#define IPR2                          1043
#define TMR3IP                        1044
#define LVDIP                         1045
#define BCL1IP                        1046
#define BCLIP                         1047
#define CMIP                          1048
#define OSCFIP                        1049
#define PIE3                          1050
#define RXBNIE                        1051
#define CCP1IE                        1052
#define RXB1IE                        1053
#define CCP2IE                        1054
#define TXB0IE                        1055
#define TXB2IE                        1056
#define TXBNIE                        1057
#define TX2IE                         1058
#define RC2IE                         1059
#define LCDIE                         1060
#define PIR3                          1061
#define RXBNIF                        1062
#define CCP1IF                        1063
#define CCP2IF                        1064
#define TXBNIF                        1065
#define TX2IF                         1066
#define RC2IF                         1067
#define LCDIF                         1068
#define IPR3                          1069
#define RXBNIP                        1070
#define CCP1IP                        1071
#define CCP2IP                        1072
#define TX2IP                         1073
#define TXBNIP                        1074
#define RC2IP                         1075
#define LCDIP                         1076
#define EECON1                        1077
#define WR                            1078
#define WREN                          1079
#define WRERR                         1080
#define FREE                          1081
#define LCDCON                        1082
#define LMUX0                         1083
#define LMUX                          1084
#define LMUX1                         1085
#define CS                            1086
#define CS0                           1087
#define LCDCS0                        1088
#define CS1                           1089
#define LCDCS1                        1090
